require File.expand_path(File.dirname(__FILE__) + '/../spec_helper')

describe BooksController do

  describe "adding new row" do

    before(:each) do
      @sample_data = <<EOS
"date","বইয়ের নাম","লেখক/অনুবাদক/সম্পাদক","বইয়ের ধরণ/বিষয়","প্রকাশনা প্রতিষ্ঠান/প্রকাশক","প্রকাশকাল","মূল্য"
"Feb 2, 2009","পতিতা","হায়দার আনসারী","উপন্যাস","আমীর প্রকাশন","গ্রন্থমেলা ২০০৯",80
"Feb 2, 2009","মেহেরজান","হায়দার আনসারী","উপন্যাস","আমীর প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 2, 2009","কালবৈশাখী","হায়দার আনসারী","উপন্যাস","আমীর প্রকাশন","গ্রন্থমেলা ২০০৯",80
"Feb 2, 2009","ঢাকার গাছ সাদা","হায়দার আনসারী","উপন্যাস","আমীর প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 2, 2009","ফুলফুলিয়ার কথা","হায়দার আনসারী","উপন্যাস","আমীর প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 2, 2009","স্মৃতির আরশিতে","হায়দার আনসারী","উপন্যাস","আমীর প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 2, 2009","ফুল কুমারীর দীঘি","প্রত্যয় জসীম","কিশোর উপন্যাস","জিনিয়াস পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",75
"Feb 2, 2009","মাছের মাগো মাছের মা","আবু সাঈদ জুবেরী","কিশোর উপন্যাস","জিনিয়াস পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",75
"Feb 2, 2009","মোহাম্মদ মনিরুজ্জামান কবি ও কোবিদ","সম্পাদক : ড. মোহাম্মদ হাননান","কবিতা","আগামী প্রকাশনী","গ্রন্থমেলা ২০০৯",700
"Feb 2, 2009","ওকালতি ও জজিয়তি জীবনের জলরেখা","মোহাম্মদ গোলাম রাব্বানী","স্মৃতিকথা","অ্যাডর্ন পাবলিকেশন","অক্টোবর ২০০৮",120
"Feb 2, 2009","রাজা ভাওয়াল সন্ন্যাস ও ভাওয়াল পরগনা","জয়নাল হোসেন","প্রবন্ধ","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",360
"Feb 2, 2009","পূর্ব বাঙলার উপন্যাস","মনসুর মুসা","প্রবন্ধ","অ্যাডর্ন পাবলিকেশন","জুলাই ২০০৮",200
"Feb 2, 2009","মুক্তিযুদ্ধের ইতিহাস","মুহম্মদ জাফর ইকবাল","মুক্তিযুদ্ধ বিষয়ক","প্রতীতি","ডিসেম্বর ২০০৮",10
"Feb 2, 2009","প্রিয় পদরেখা","হুমায়ূন আহমেদ","মুক্তিযুদ্ধ বিষয়ক","আফসার ব্রাদার্স","গ্রন্থমেলা ২০০৯",200
"Feb 2, 2009","বসন্ত তোমার মন ছুঁয়েছে","মোহাম্মদ মিজানুর রহমান","উপন্যাস","সৃজনী","গ্রন্থমেলা ২০০৯",140
"Feb 2, 2009","গল্প আর গল্প","অপরেশ বন্দ্যোপাধ্যায়","উপন্যাস","হোসাইনিয়া লাইব্রেরী","গ্রন্থমেলা ২০০৯",80
"Feb 2, 2009","Tagore Ibsen and other essays","Muhammad Habibur Rahman","প্রবন্ধ","অ্যাডর্ন পাবডিলকেশন্স","জুলাই ২০০৮",200
"Feb 2, 2009","ভাটির দেশে যাত্রা","মোমিনুল হক","উপন্যাস","অ্যাডর্ন পাবডিলকেশন্স","গ্রন্থমেলা ২০০৯",250
"Feb 2, 2009","কে তাহারে চিনতে পারে","সাইমন জাকারিয়া","উপন্যাস","অ্যাডর্ন পাবডিলকেশন্স","গ্রন্থমেলা ২০০৯",110
"Feb 2, 2009","The laughter of a slave","Shaukat Osman","উপন্যাস","অ্যাডর্ন পাবডিলকেশন্স","ডিসেম্বর ২০০৮",150
"Feb 2, 2009","ড’য়লির ঢাকা","রিদওয়ান আক্রাম","ইতিহাস","আকাশ","গ্রন্থমেলা ২০০৯",160
"Feb 2, 2009","এনজিও আহলাদ","মোখতার হোছাইন","এনজিও","সত্যকথা প্রকাশ (পরিবেশক : সালাউদ্দীন বইঘর)","গ্রন্থমেলা ২০০৯",60
"Feb 3, 2009","রক্ততৃষ্ণা","মোশতাক আহমেদ","ভৌতিক","নালন্দা","জানুয়ারি ২০০৯",135
"Feb 3, 2009","শান্ত নিরপেক্ষ তত্ত্বাবধায়ক সন্ত্রাস","ইমতিয়ার শামীম","রাজনীতি","নালন্দা","গ্রন্থমেলা ২০০৯",150
"Feb 3, 2009","রোবটের পৃথিবী","মোশতাক আহমদ","সায়েন্স ফিকশন","নালন্দা","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","নির্বাচিত রাজনৈতিক রচনা","মোনায়েম সরকার","রাজনীতি","নালন্দা","গ্রন্থমেলা ২০০৯",300
"Feb 3, 2009","কাশফুলে মুক্তির গান","মোঃ রফিকুল ইসলাম","সঙ্গীত","কাশবন প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","সংখ্যাতত্ত্বে আনন্দ ভ্রমণ","রক্তিম বড়–য়া","গণিত","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",150
"Feb 3, 2009","বাঙালির সামরিক ঐতিহ্য","মাহবুব-উল-আলম","ইতিহাস","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",180
"Feb 3, 2009","স্বাধীনতা সংগ্রামে চট্টগ্রাম","পূর্ণেন্দু দস্তি","মুক্তিযুদ্ধ","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",250
"Feb 3, 2009","অক্টোপাসের চোখ","মুহম্মদ জাফর ইকবাল","বিজ্ঞান বিষয়ক","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",160
"Feb 3, 2009","বিজয়ী হবে বাংলাদেশ","আনিসুল হক","রম্য","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",140
"Feb 3, 2009","এবং বউকাঁটা","সাইফুল্লাহ নবীন","উপন্যাস","একতা প্রকাশ","নভেম্বর ২০০৮",60
"Feb 3, 2009","দৈন্য শোভেনা বাঙালীর","মোঃ মফিজ উদ্দিন","কবিতা","একতা প্রকাশ","ডিসেম্বর ২০০৮",80
"Feb 3, 2009","একাকী","অসীম কুমার","উপন্যাস","একতা প্রকাশ","ডিসেম্বর ২০০৮",60
"Feb 3, 2009","কালের ছড়া","শাহাবুদ্দীন নাগরী","শিশুতোষ","ম্যাগনাম ওপাস","গ্রন্থমেলা ২০০৯",150
"Feb 3, 2009","শব্দকল্প দ্রুম","হায়াৎ মামুদ","বাংলা ভাষা","চারুলিপি প্রকাশন ","গ্রন্থমেলা ২০০৯",225
"Feb 3, 2009","প্রাচীন শিক্ষাধারা ও দর্শন","এটিএম শাহআলম সিকদার","প্রবন্ধ","নন্দিতা প্রকাশ","জুলাই ২০০৮",120
"Feb 3, 2009","স্বপ্ন সুখ","জাকির হোসেন","কবিতা","নন্দিতা প্রকাশ","গ্রন্থমেলা ২০০৯",60
"Feb 3, 2009","প্রেম ও অনুভব","মাহবুব শাহরিয়ার","উপন্যাস","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",150
"Feb 3, 2009","মহা পৃথিবী","মাহবুব শাহরিয়ার","মুক্তিযুদ্ধ","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",150
"Feb 3, 2009","‘না’","মোহিত কামাল","মুক্তিযুদ্ধ","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",275
"Feb 3, 2009","বউবাসা","সাইফুল্লাহ্ নবীন","মুক্তিযুদ্ধ","লেখনী","গ্রন্থমেলা ২০০৯",80
"Feb 3, 2009","লালন সাঁই","আবুল আহসান চৌধুরী","জীবনী","সূচীপত্র","জূলাই ২০০৮",250
"Feb 3, 2009","ফোকলোর বা লোককলা","শরদিন্দু ভট্টাচার্য","লোকসাহিত্য","সূচীপত্র","মে ২০০৮",80
"Feb 3, 2009","গল্প সমগ্র","আনিসুল ইসলাম","গল্প","স্বরাজ প্রকাশনী","নভেম্বর ২০০৮",200
"Feb 3, 2009","সে আমার ইচ্ছার বাস্তব","আনিসুল ইসলাম","কবিতা","স্বরাজ প্রকাশনী","নভেম্বর ২০০৮",80
"Feb 3, 2009","একটি খুনের প্রস্তুতি বৈঠকের পর","মনি হায়দার","গল্প","স্বরাজ প্রকাশনী","সেপ্টেম্বর ২০০৮",140
"Feb 3, 2009","মুক্তি সংগ্রাম থেকে মুক্তিযুদ্ধে যাত্রা","ইঞ্জিনিয়ার সিদ্দিক আহমদ","মুক্তিযুদ্ধ","স্বরাজ প্রকাশনী","নভেম্বর ২০০৮",50
"Feb 3, 2009","একাত্তরের উত্তাল দিনগুলি","উপেন তরফদার","মুক্তিযুদ্ধ","স্বরাজ প্রকাশনী","নভেম্বর ২০০৮",220
"Feb 3, 2009","মুক্তিযুদ্ধে সশস্ত্র প্রতিরোধ ও রণাঙ্গন","এএসএম সামছুল আরেফিন","মুক্তিযুদ্ধ","স্বরাজ প্রকাশনী","ডিসেম্বর ২০০৮",20
"Feb 3, 2009","চন্দ্রশিলায় কালো দাগ","বাদল মেহেদী","উপন্যাস","শিরীন পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",65
"Feb 3, 2009","ফেরারী ফাল্গুন","কে হাসান সবুজ","উপন্যাস","শিরীন পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",80
"Feb 3, 2009","আমরা তোমাদের ভুলবো না","সরদার জয়েনউদ্দীন","মুক্তিযুদ্ধ","বিজয় প্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","মন + হৃদয়","আনিসুল হক","গল্প","কাকলী প্রকাশনী","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","বাদল দিনের দ্বিতীয় কদমফুল","হুমায়ূন আহমেদ","উপন্যাস","কাকলী প্রকাশনী","গ্রন্থমেলা ২০০৯",150
"Feb 3, 2009","জাগো অন্ধকারের নারী","মিনা ফারাহ্ ","উপন্যাস","লেখনী","গ্রন্থমেলা ২০০৯",250
"Feb 3, 2009","আহমদ ছফার সাক্ষাৎকার সমগ্র","নূরুল আনোয়ার","সাক্ষাৎকার","খান ব্রাদার্স এ্যান্ড কোম্পানি","গ্রন্থমেলা ২০০৯",250
"Feb 3, 2009","পরীকুমার","জসীম আল ফাহিম","শিশুতোষ","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",60
"Feb 3, 2009","দহন ও দ্রোহের গল্প","জাহানারা নূরী","গল্প সংকলন","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",30
"Feb 3, 2009","গণগীতিকার শাহ আবদুল করিম","সুমন কুমার দাশ","গবেষণাগ্রন্থ","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",30
"Feb 3, 2009","এঙঙউ ঐঅইওঞঝ ভালো অভ্যাস","আহসান হাবীব","শিক্ষামূলক","প্রগতি পাবলিশার্স",2008,80
"Feb 3, 2009","ইউরোপের পথে প্রান্তরে","নিলুফার কবির","ভ্রমণ কাহিনী","মুক্তচিন্তা",2008,150
"Feb 3, 2009","ভূত আমার পুত","হুমায়ূন আহমেদ","ভূতের গল্প","প্রগতি পাবলিশার্স",2009,150
"Feb 3, 2009","মেয়েটির নাম নারীনা","মুহম্মদ জাফর ইকবাল","কিশোর উপন্যাস","পার্ল পাবলিকেশন্স",2009,170
"Feb 3, 2009","মায়া","আনিসুল হক","উপন্যাস","পার্ল পাবলিকেশন্স",2009,120
"Feb 3, 2009","ঐঊখখঙ ঠগবাজ","সুমন্ত আসলাম","উপন্যাস","পার্ল পাবলিকেশন্স",2009,130
"Feb 3, 2009","বর্ষা কাজল চোখে","শাহাদাত সোহাগ","উপন্যাস","শিখা প্রকাশনী",2009,75
"Feb 3, 2009","দন্ত্যন রুহমান","সুমন্ত আসলাম","উপন্যাস","শিখা প্রকাশনী",2009,125
"Feb 3, 2009","টাইগার’স জাম্রিং ক্লাব ও অন্যান্য রম্য","আহসান হাবিব","রম্যরচনা","শিখা প্রকাশনী",2009,150
"Feb 3, 2009","মন","ইমদাদুল হক মিলন","উপন্যাস","শিখা প্রকাশনী","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","অশ্র“ ভেজা আঁচল","এ. আর. মামুন-উর-রশীদ","কবিতা","শিখা প্রকাশনী","গ্রন্থমেলা ২০০৯",60
"Feb 3, 2009","উড়াল গদ্য","কাজী জহিরুল ইসলাম","প্রবন্ধ","একুশে বাংলা প্রকাশন","গ্রন্থমেলা ২০০৯",120
"Feb 3, 2009","বনসাই জীবন","ডা. নাসিম জাহান","উপন্যাস","একুশে বাংলা প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","মালারানী","কৃষণ চন্দর","উপন্যাস","মুক্তধারা","ডিসেম্বর ২০০৮",120
"Feb 3, 2009","নারীবাদী গল্প","পূরবী বসু","ছোটগল্প","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",130
"Feb 3, 2009","দু’টি নারী একটি প্রবন্ধ","বেগম মুশতারী শফী","ছোটগল্প","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 3, 2009","অনন্তের সন্ধানে","আবদুস সালাম খান পাঠান","কবিতা","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",80
"Feb 3, 2009","পুরানো ঢাকায় চলচ্চিত্র","অনুপম হায়াৎ","চলচ্চিত্র","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 3, 2009","মুক্তিযুদ্ধের কিশোর গল্প","রফিকুর রশীদ","গল্প","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 3, 2009","আধুনিক শিক্ষাদান পদ্ধতি ও শ্রেণীকক্ষ ব্যবস্থাপনা","ড. মোঃ মনোয়ার হোসেন","বিবিধ","আহমদ পাবলিশিং হাউস","জুন ২০০৮",130
"Feb 3, 2009","অর্থনৈতিক কর্মকান্ডে গতিঃ দরিদ্র বিমোচন","আনু মাহমুদ","প্রবন্ধ","আহমদ পাবলিশিং হাউস","এপ্রিল ২০০৮",200
"Feb 3, 2009","নাজাতের আমল","ড. আবুল খায়ের মুহাম্মদ আবদুর রব","ধর্মীয়","আহমদ পাবলিশিং হাউস","সেপ্টেম্বর ২০০৮",100
"Feb 3, 2009","মানবী","হুমায়ূন আহমদ","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",135
"Feb 3, 2009","কানাগলির মানুষেরা","সৈয়দ মনজুরুল ইসলাম","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",180
"Feb 3, 2009","অচলায়তনে","নাজমা জাহান","উপন্যাস","কাশবন প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","আঁধারে রঙিন রাখাল","নাসরীন জাহান","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","পরিবর্তনের অর্থনীতি","মামুন রশীদ","অর্থনীতি","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",225
"Feb 3, 2009","সিংগাপুরের সিংহলী সাহেব","ফরিদুর রেজা সাগর","ছোটদের বই","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","ও বন্ধু আমার","ইমদাদুল হক মিলন","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","ফেলে আসা লাল গোলাপ","ইমদাদুল হক মিলন","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","কুয়াশার ভোর","রাবেয়া খাতুন","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 3, 2009","আজ দুপুরে তোমার নিমন্ত্রণ","হুমায়ূন আহমেদ","ছোটগল্প","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",140
"Feb 3, 2009","বল পয়েন্ট","হুমায়ূন আহমেদ","আত্মজীবনী","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",180
"Feb 3, 2009","কে তুমি","সুমন্ত আসলাম","উপন্যাস","অন্যপ্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 3, 2009","বিজ্ঞানের খেলাপড়া","শেখ আনোয়ার","বিজ্ঞান","আফসার ব্রাদার্স","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","হারিয়ে যাওয়া কানের দুল","পরিতোষ বাড়ৈ","উপন্যাস","আফসার ব্রাদার্স","গ্রন্থমেলা ২০০৯",80
"Feb 3, 2009","সামরিক তত্ত্বাবধায়ক সরকারের আমলে বাংলাদেশ","বদরুদ্দীন উমর","প্রবন্ধ","আফসার ব্রাদার্স","গ্রন্থমেলা ২০০৯",250
"Feb 3, 2009","‘হলো না স্বপ্নপূরণ’","হেলেন রহমান","উপন্যাস","রঙিন ফুল","গ্রন্থমেলা ২০০৯",100
"Feb 3, 2009","পটুয়া রঘুনাথের শিল্পভুবন","দিলদার হোসেন","পটচিত্র","আর.এল.পি. বাংলাদেশ","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","প্রেম হলেও হতে পারত","জামাল রেজা","গল্প","নওরোজ কিতাবিস্তান","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","জলের দেয়াল","আবুল বাসার","উপন্যাস","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",180
"Feb 4, 2009","ক্যাপ্টেন রবিন","পরিতোষ বাড়ৈ","উপন্যাস","নওরোজ কিতাবিস্তান","গ্রন্থমেলা ২০০৯",75
"Feb 4, 2009","হৃদয় ছোঁয়া","জিল্লুর রহমান শুভ্র","উপন্যাস","নওরোজ কিতাবিস্তান","গ্রন্থমেলা ২০০৯",125
"Feb 4, 2009","প্রেমবক্সের ক্রিকেট ড্রইং রুমের ফুটবল","মোস্তফা মামুন","ক্রিড়া বিষয়ক","নওরোজ কিতাবিস্তান","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","উত্তর আফ্রিকার আরব রাষ্ট্রসমূহের রাজনৈতিক ইতিহাস","মোঃ হুমায়ূন কবির চৌধুরী","রাজনৈতিক","সূচীপত্র","মে ২০০৮",140
"Feb 4, 2009","বনলতা সেন","জীবনানন্দ দাশ","কবিতা","সূচীপত্র","আগস্ট ২০০৮",50
"Feb 4, 2009","অনুমানব","মোশতাক আহমেদ","বিজ্ঞান","নালন্দা","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","Sultan","Hasnat Abdul Hye","উপন্যাস","অ্যাডর্ন পাবলিকেশন","ডিসেম্বর ২০০৮",450
"Feb 4, 2009","এফফেনতি : মোল্লা নাসিরুদ্দিন হোজা এফফেনতির গল্প","সাযযাদ কাদির","গল্প","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",175
"Feb 4, 2009","স্বাতি এক নক্ষত্রের নাম","মোমিনুল হক","গল্প","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",250
"Feb 4, 2009","Plumed Peacock","Kabir Chowdhury","উপন্যাস","অ্যাডর্ন পাবলিকেশন","জানুয়ারি ২০০৯",250
"Feb 4, 2009","The Blue Sting","Syed Shamsul Haq","উপন্যাস","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","গমক্ষেতে কাক ও অন্যান্য লেখা","কবীর চৌধুরী","প্রবন্ধ","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",200
"Feb 4, 2009","হ্যালো ক্যাডেটস","মোস্তফা মামুন","উপন্যাস","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",180
"Feb 4, 2009","সারাবেলা তোমার সঙ্গে","জুলফিয়া ইসলাম","উপন্যাস","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",160
"Feb 4, 2009","যাতনার তরী","আবু তাহের","কবিতা","তাম্রলিপি",2008,100
"Feb 4, 2009","বীরকন্যা প্রীতিলতা","পূর্ণেন্দু দস্তিদার","জীবনী","অনুপম প্রকাশনী",2008,80
"Feb 4, 2009","জীবনের শত্র“মিত্র","মোরশেদ শফিউল হাসান","বিজ্ঞান","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",50
"Feb 4, 2009","বিজ্ঞানের শত আবিষ্কারের কথা","ভবেশ রায়","বিজ্ঞান","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",200
"Feb 4, 2009","দিঘীর জলে পুরনো চাঁদের শব","শামসুজ্জামান হীরা","গল্প","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",140
"Feb 4, 2009","প্রসঙ্গ বাঙলা গান","ড. করুণাময় গোস্বামী","প্রবন্ধ","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","শাদা পায়রা কালো কাক","আলী ইমাম","শিশুতোষ","শব্দশিল্প","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","সোনার আপেল কালো ঘোড়া","আলী ইমাম","ছোটদের গল্প","শব্দশিল্প","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","সেই অখণ্ড বৃত্তে","সিরাজুল ইসলাম চৌধুরী","প্রবন্ধ","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",200
"Feb 4, 2009","রক্তপুঁজে গেথে যাওয়া মাছি","আকিমুন রহমান","উপন্যাস","অংকুর প্রকাশনী","গ্রন্থমেলা ২০০৯",200
"Feb 4, 2009","স্বাধীনতা সংগ্রামে রাঙ্গুনিয়া (১৭১১-১৯৭৮১ ’৭১-এর স্মৃতি","মোঃ ছালেহ্ আহ্মেদ","মুক্তিযুদ্ধ","অংকুর প্রকাশনী","গ্রন্থমেলা ২০০৯",200
"Feb 4, 2009","মেঘের গায়ে চুমকি জ্বলে","নাজমাতুল আলম","বাচ্চাদের গল্প ও ছড়া","টইটম্বুর","গ্রন্থমেলা ২০০৯",90
"Feb 4, 2009","এই প্রথম এই শেষ রাজধানী ঢাকা-বাংলাদেশ","মোঃ মোশারফ হোসেন","ইতিহাস","বিজয় প্রকাশ",2008,12
"Feb 4, 2009","বারাক ওবামা দ্য অ্যডা সিটি অব হোপ","মাসুমুর রহমান খলিলী ও মাসুম বিল্লাহ","জীবনী","অঙ্কুর প্রকাশনী","গ্রন্থমেলা ২০০৯",350
"Feb 4, 2009","বঙ্গবন্ধুর রাষ্ট্রচিন্তা ও বর্তমান বাংলাদেশ","শামসুজ্জামান খান","গবেষণামূলক","বিজয় প্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","কিশোর শিশুর গল্প মাতৃভূমির প্রেমে","আলী আশরাফ বিশ্বাস","ছোটগল্প","শিরীন পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","ঋদ্ধ কৃষ্ণচূড়া তোমাকে","আদিত্য অনিক","কবিতা","শ্রাবণ প্রকাশনী","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","বই বিশ্বে দশ দিন","রবীন আহসান","ভ্রমণ","শ্রাবণ প্রকাশনী",2008,150
"Feb 4, 2009","কুয়াশায় ঢাকা পথ","এম.ডি নান্টুরাজ","উপন্যাস","শিরীন পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",60
"Feb 4, 2009","পাঁচজনা","আনোয়ারা আজাদ","উপন্যাস","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",250
"Feb 4, 2009","আমাদের কালের কথা","সৈয়দ মুর্তাজা আলী","আত্মজীবনী","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",300
"Feb 4, 2009","মরমি সাধক তৌরিছ মিয়া","রাব্বানী চৌধুরী","লোকসাহিত্য","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","আফটার দ্যা রোড এক্সিডেন্ট","আকাশ প্রদীপ","গল্প","একতা প্রকাশ","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","অনন্ত অভিসম্পাত","মীজান মোহাম্মদ","উপন্যাস","একতা প্রকাশ","ডিসেম্বর ২০০৮",150
"Feb 4, 2009","আবু ইব্রাহীমের মৃত্যু","শহীদুল জহির","উপন্যাস","মাওলা ব্রাদার্স","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","দেয়ালের শহর ঢাকা","মুনতাসীর মামুন","স্মৃতিচারণ","মাওলা ব্রাদার্স","গ্রন্থমেলা ২০০৯",125
"Feb 4, 2009","ভেবনা আমি ভালো আছি","মাসুদ উর রহমান","কবিতা","জ্যোতিপ্রকাশ","গ্রন্থমেলা ২০০৯",140
"Feb 4, 2009","চুয়াত্তর সিঁড়ি পার","বুলবুল আরা নাসিম","স্মৃতিচারণ","পারিজাত প্রকাশনী","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","উপহার, তোমার জন্য","তৌহিদুর রহমান","কবিতা","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","ভূতের বাড়িতে একরাত","জাবেদ ইমন","গল্প","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",70
"Feb 4, 2009","রঙ্গভরা বঙ্গ","সুফিয়া বেগম","রম্যগল্প","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 4, 2009","বিনিপয়সার নীলগল্প","সৈয়দ শামসুল হক","উপন্যাস","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","যেমন দেখেছি জাপান","সুফিয়া বেগম","ভ্রমণ","ইত্যাদি গ্রন্থপ্রকাশ","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","বাউণ্ডুলে/৮","সুমন্ত আসলাম","রম্যরচনা","পার্ল পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","রঙ্গভরা বঙ্গদেশ","আনসিুল হক","রম্যরচনা","পার্ল পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",140
"Feb 4, 2009","অন্ধকারের অন্তরালে","শফিকুল ইসলাম","উপন্যাস","মুক্তদেশ প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","প্রিয়তমা","মোস্তফা কামাল","উপন্যাস","পার্ল পাবিলকেশন্স","গ্রন্থমেলা ২০০৯",120
"Feb 4, 2009","কাকা পাখি ও হুরি হাক্কা","মোঃ আমির আলী বেগ","শিশুতোষ","শব্দশিল্প","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","এতোদিন কোথায় ছিলাম কোথায় ছিলে","গাজী নাছরিন আক্তার নাজ","কবিতার বই","শব্দশিল্প","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","শবযাত্রায় পশুপাখি যাবে","শেখ কামাল হোসেন","কবিতা","মুক্তচিন্তা প্রকাশনা",2008,70
"Feb 4, 2009","রায়হানের রাজহাঁস","আবু কায়সার","কিশোর উপন্যাস","মুক্তধারা",2008,120
"Feb 4, 2009","জন্ম দিও বঙ্গে","নির্মলেন্দু গুণ","কবিতা","বিভাস","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","রাজা প্রজা বানানো গণপ্রজাতন্ত্রী নয় গণজনতাতন্ত্রী বাংলাদেশ চাই","এস. এম. ফরিদুল হক (মুকুল)","রাজনেতিক","লেখক প্রকাশনী",2008,30
"Feb 4, 2009","øিগ্ধ ভালোবাসা চাই","কানিজ কাদীর","কবিতা","পারিজাত প্রকাশনী",2009,60
"Feb 4, 2009","ইচ্ছে স্বপ্ন","মাহমুদা সেলিনা","কবিতা","পারিজাত প্রকাশনী",2009,80
"Feb 4, 2009","গোধূলি বেলায় জীবনের প্রতিচ্ছবি","নূরুন নাহার","স্মৃতিচারণ","পারিজাত প্রকাশনী",2009,60
"Feb 4, 2009","জরীর কাছে একটা পরী এসেছিল","শাকিল ফারুক","শিশুতোষ","ঝিঙেফুল",2009,60
"Feb 4, 2009","সেতু","ফরিদুর রেজা সাগর","শিশুতোষ","ঝিঙেফুল",2009,100
"Feb 4, 2009","জীবনের আঁকিবুঁকি","বুলবুল চৌধুরী","গল্প","দি ইউনিভার্সেল একাডেমী",2009,100
"Feb 4, 2009","টু উইমেন","শেখ আব্দুল হাকিম","উপন্যাস","দি ইউনিভার্সেল একাডেমী",2009,250
"Feb 4, 2009","প্রেমের উর্ধ্বে ভালোবাসা","গাজী জালাল উদ্দিন আহমেদ","উপন্যাস","মিজান পাবলিশার্স","আগস্ট ২০০৮",100
"Feb 4, 2009","ছোটখালুর কুইজ বিজয়","ফরিদুর রেজা সাগর","শিশুতোষ","ঝিঙেফুল","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","দ্য ব্যাটল ফিল্ড","গোলাম ফারুক স্বপন","উপন্যাস","চারুলিপি প্রকাশন","গ্রন্থমেলা ২০০৯",125
"Feb 4, 2009","দিন বদলের অঙ্গীকার","শেখ হাসিনা","নির্বাচনী ইশতেহার","র‌্যামন পাবলিশার্স","গ্রন্থমেলা ২০০৯",80
"Feb 4, 2009","দুঃখ ফেরিওয়ালা","সুজন রায়","কবিতা","নন্দিতা প্রকাশ","গ্রন্থমেলা ২০০৯",60
"Feb 4, 2009","সর্বকালের সর্বশ্রেষ্ঠ প্রেমিক জুটি","কাপ্তান নূর","গল্প","গ্লোব লাইব্রেরি","গ্রন্থমেলা ২০০৯",160
"Feb 4, 2009","ছোটদের কল্পগল্প","আহসান হাবীব","গল্প","দি ইউনিভার্সেল একাডেমী","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","দ্বিচারিনী","আলবার্তো মোরাভিয়া","উপন্যাস","দি ইউনিভার্সেল একাডেমী","গ্রন্থমেলা ২০০৯",250
"Feb 4, 2009","একালের লোলিটা এবং (সাতটি রংধনু গল্প)","কাপ্তান নূর","শিশুতোষ","গ্লোব লাইব্রেরী (প্রাঃ) লিমিটেড","গ্রন্থমেলা ২০০৯",120
"Feb 4, 2009","কিচির মিচির","রোকেয়া শাহেদ","শিশুতোষ","গ্লোব লাইব্রেরী (প্রাঃ) লিমিটেড","গ্রন্থমেলা ২০০৯",50
"Feb 4, 2009","রাঙ্গামাটির স্মৃতি","মোঃ মোজাম্মেল হোসেন","উপন্যাস","নন্দিতা প্রকাশ","গ্রন্থমেলা ২০০৯",140
"Feb 4, 2009","বিসর্জন","কে. এম. আজাদুল ইসলাম","ছোটগল্প","মৌ প্রকাশনী","গ্রন্থমেলা ২০০৯",60
"Feb 4, 2009","হুমায়ুননামা","খালেক বিন জয়েনউদদীন","ছড়া","বর্ণায়ন","গ্রন্থমেলা ২০০৯",55
"Feb 4, 2009","কোরআন, স্বাস্থ্য ও দীর্ঘজীবন","মোঃ নূরুল ইসলাম বেনু","স্বাস্থ্য","গ্লোব লাইব্রেরী (প্রাঃ) লিমিটেড",2008,450
"Feb 4, 2009","পুনশ্চর্বিত চর্বনানাম","আহসান হাবীব","জোকস","অবসর প্রকাশনা সংস্থা","গ্রন্থমেলা ২০০৯",115
"Feb 4, 2009","যে তুমি নিরন্তর","বরেন চক্রবর্তী","কবিতা","অবসর প্রকাশনা সংস্থা","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","আমার চুম্বনগুলো পৌঁছ দাও","শহীদ কাদরী","কবিতা","অবসর প্রকাশনা সংস্থা","গ্রন্থমেলা ২০০৯",100
"Feb 4, 2009","সায়েন্স ফিকশন","আহসান হাবীব","সায়েন্স ফিকশন","একুশে বাংলা প্রকাশন","গ্রন্থমেলা ২০০৯",150
"Feb 4, 2009","নীল কাষ্ঠের ঢেউ","মীর্জা আমীর","উপন্যাস","চয়ন প্রকাশন","গ্রন্থমেলা ২০০৯",125
"Feb 4, 2009","হীরের মাটি সোনার ফুল","জুলি রহমান ও মীর্জা আমীর","কাব্য","চয়ন প্রকাশন","গ্রন্থমেলা ২০০৯",125
"Feb 4, 2009","শ্রাবণের জোছনা ভরা রাত","হাফিজ আল ফারুকী","উপন্যাস","কাকলী প্রকাশনী","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","সৃজনশীল গণতন্ত্রের আকাক্সক্ষায়","মুহাম্মদ হাবিবুর রহমান","প্রবন্ধ","অ্যাডর্ন পাবলিকেশন","ডিসেম্বর ২০০৮",135
"Feb 5, 2009","সংশয়ীদের ঈশ্বর","আহম্মদ মোস্তফা কামাল","প্রবন্ধ","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",135
"Feb 5, 2009","এক কিশোরের মন","হুমায়ুন সাদেক চৌধুরী","ছড়া","অ্যাডর্ন পাবলিকেশন","গ্রন্থমেলা ২০০৯",50
"Feb 5, 2009","কালের সাক্ষী","মুসাফির","মুক্তিযুদ্ধ","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",240
"Feb 5, 2009","এক বাক্স ভূত","জিল্লুর রহমান শুভ্র","বাচ্চাদের ভূতের গল্প","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",135
"Feb 5, 2009","রেললাইন ধরে কে যায় সন্ধ্যায়","জামাল রেজা","উপন্যাস","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","ভূতে ভূতে লড়াই","সাঈফ আবেদীন","গল্প","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",75
"Feb 5, 2009","সবুজ পাতার মেয়ে","জিল্লুর রহমান শুভ্র","উপন্যাস","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","দুঃখ বিলাস","পরিতোষ বাড়ৈ","উপন্যাস","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","অতৃপ্ত ভালোবাসা","তন্ময় মতিন","উপন্যাস","নূর কাসেম পাবলিশার্স","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","রকমারী রান্না ও পুষ্টি","শরিফা তাসনীম","রান্না বিষয়ক","আহমদ পাবলিশিং হাউস","গ্রন্থমেলা ২০০৯",250
"Feb 5, 2009","মুক্তিযুদ্ধে বিলাত প্রবাসীদের অবদান","ড. খন্দকার মোশাররফ হোসেন","মুক্তিযুদ্ধ","আহমদ পাবলিশিং হাউস",2008,350
"Feb 5, 2009","মাকতুবাত-ই-সাইয়্যিদিল মুরসালীন (দ.)","এ. এস. এম. আব্দুল হাই","ধর্মীয়","আহমদ পাবলিশিং হাউস","আগস্ট ২০০৮",160
"Feb 5, 2009","ডানপিটে ডাবলু","সুমন্ত আসলাম","উপন্যাস","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",110
"Feb 5, 2009","চক্ষে আমার তৃষ্ণা","হুমায়ূন আহমেদ","উপন্যাস","অনুপম প্রকাশনী","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","ইৎরঃরংয এঁবংঃ","গড়ংঃধভধ অযধসধফ ঝযড়যৎধন","উপন্যাস","শিরীন পাবলিকেশন","গ্রন্থমেলা ২০০৯",200
"Feb 5, 2009","দিগন্তপানে","মাহফুজা আলম শান্তা","কাব্য","শিরীন পাবলিকেশন","গ্রন্থমেলা ২০০৯",150
"Feb 5, 2009","রম্যলেখকের বিশ্বপরিক্রমা","আতাউর রহমান","রম্য","ঐতিহ্য","গ্রন্থমেলা ২০০৯",170
"Feb 5, 2009","ব্ল্যাক","আজম খান","গল্প","বাবলি প্রকাশনী","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","কোয়ান্টাম মেকানিক্স","মুহম্মদ জাফর ইকবাল","বিজ্ঞান","মাওলা ব্রাদার্স","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","পাবনা অঞ্চলের লোকসংস্কৃতি","এম. আবদুল আলীম","লোকসংস্কৃতি","শিরীন পাবলিকেশন্স","এপ্রিল ২০০৮",160
"Feb 5, 2009","ভুবন গায়ের চালচিত্র","রেজাউল করিম তালুকদার","প্রবন্ধ","মুক্তচিন্তা প্রকাশনা","অক্টোবর ২০০৮",120
"Feb 5, 2009","ভালবাসার ভাড়া বেশি","অরুণ কুমার বিশ্বাস","রম্য","অয়ন প্রকাশন","গ্রন্থমেলা ২০০৯",125
"Feb 5, 2009","নির্বাচিত কলাম","আফতাব চৌধুরী","কলাম-সংকলন","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",200
"Feb 5, 2009","সোনার দেশের ছড়া","রব্বানী চৌধুরী","ছড়া","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",60
"Feb 5, 2009","Ajobithi and others","Sumitra Dev","কবিতা","উৎস প্রকাশন","গ্রন্থমেলা ২০০৯",60
"Feb 5, 2009","অল্পস্বল্প হাসির গল্প","সম্পা. রুহুল আমিন বাবুল",,"বাংলা প্রকাশ","গ্রন্থমেলা ২০০৯",240
"Feb 5, 2009","Ballads from Anthology Bangladesh an Poems","Helal Uddin Ahmed","কবিতা","সূচীপত্র","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","মীর মশাররফ হোসেন","আবুল আহসান চৌধুরী","গবেষণা","সূচীপত্র","জুলাই ২০০৮",195
"Feb 5, 2009","চিত্রকলা বিজ্ঞান ও প্রযুক্তি","সৈয়দ লুৎফুল হক","চিত্রকলা","অসর প্রকাশনা সংস্থা","গ্রন্থমেলা ২০০৯",225
"Feb 5, 2009","সুকাথাই চিয়াংমাই থাইল্যান্ডে ঘুরে বেড়ানো","মঈনুস সুলতান","ভ্রমণ কাহিনী","অবসর প্রকাশনা সংস্থা","গ্রন্থমেলা ২০০৯",135
"Feb 5, 2009","ছোট বড়ো সবার মাইকেল","পরিতোষ বাড়ৈ","উপন্যাস","পার্ল পাবলিকেশন্স","জানুয়ারি ২০০৯",135
"Feb 5, 2009","নরক নন্দিনী","পরিতোষ বাড়ৈ","উপন্যাস","পার্ল পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","বিয়ের ফাঁদে","মোস্তফা মামুন","উপন্যাস","পার্ল পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","প্রেম দাও প্রেম","জামাল রেজা","উপন্যাস","পার্ল পাবলিকেশন্স","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","দেশ এবং জনগণের অর্থনৈতিক জীবন","বদরুদ্দীন উমর","প্রবন্ধ","আফসার ব্রাদার্স","গ্রন্থমেলা ২০০৯",225
"Feb 5, 2009","রহস্য অনুসন্ধানে বিজ্ঞানের র্বথ্যতা","বাছেত সুজন","বিজ্ঞান","আফসার ব্রাদার্স","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","জেনোসাইড নিছক গণহত্যা নয়","মফিদুল হক","প্রবন্ধ","বিদ্যা প্রকাশ","গ্রন্থমেলা ২০০৯",150
"Feb 5, 2009","দহনের কালবেলা","অলক মিত্র","প্রবন্ধ","ঘাস ফুল নদী","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","শিরোনামহীন কথকতা","অলক মিত্র","প্রবন্ধ","ঘাস ফুল নদী","গ্রন্থমেলা ২০০৯",70
"Feb 5, 2009","মুক্তিযুদ্ধের গল্প","মানিক হায়দার","গল্প","কথা প্রকাশ","গ্রন্থমেলা ২০০৯",300
"Feb 5, 2009","বহুমাত্রিক বিশ্বায়ন","রতন তনু ঘোষ","গবেষণা","কথা প্রকাশ","গ্রন্থমেলা ২০০৯",300
"Feb 5, 2009","সারেং বৌ","শহীদুল্লাহ কায়সার","উপন্যাস","চারুলিপি প্রকাশন","গ্রন্থমেলা ২০০৯",125
"Feb 5, 2009","অষড়হব ড়হ ঃযব ঋৎরহমব ড়ভ খরভব","ঝধুববফধ তধসধহ","কবিতা","দি রিয়েল পাবলিশার্স","গ্রন্থমেলা ২০০৯",140
"Feb 5, 2009","বন কুসুমপুর রহস্য","আলী ইমাম","কিশোর গল্প","দি রিয়েল পাবলিশার্স","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","পূর্ণ অপূর্ণ শূন্য","(নীল) ইয়াসমিন নিলুফা","ছোটগল্প","শ্রাবণ প্রকাশনী","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","ছুটির ঘণ্টা","কাজী আবুল কাশেম রতন","গল্প","মুক্তদেশ প্রকাশন","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","শেষান্তে কিছুই হয় না আর","মানিক মোহাম্মদ রাজ্জাক","কবিতা","শ্রাবণ প্রকাশনী","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","সাংবাদিকতা (দ্বিতীয় পাঠ)","আর রাজী","সাংবাদিকতা","ভাষাচিত্র","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","হেঁয়ালি","অরণ্য দত্ত তাপস","গল্পগ্রন্থ","অভিজিৎ চৌধুরী","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","পোড়ানো দুঃখের পাঁচালি","মনোয়ার সুলতান","কবিতা","ভাষাচিত্র","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","রাফখাতা","মনোয়ার সুলতান","উপন্যাস","ভাষাচিত্র","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","সপ্তডিঙা মেঘ","মনোয়ার সুলতান","উপন্যাস","ভাষাচিত্র","গ্রন্থমেলা ২০০৯",50
"Feb 5, 2009","মনে রইল সই মনের বেদনা","আবুল হুসাইন জাহাঙ্গীর","উপন্যাস","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","বহে নিরন্তর","জ্যোতির্ময় বসু","উপন্যাস","ইত্যাদি গ্রন্থ প্রকাশ",2008,130
"Feb 5, 2009","অন্তরঙ্গ দীর্ঘশ্বাস","রফিক আজাদ","কবিতা","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",70
"Feb 5, 2009","কাল তুমি নিষ্ঠুর","আমেনা আফতাব","গল্পগ্রন্থ","ইত্যাদি গ্রন্থ প্রকাশ","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","গারো সম্প্রদায় : সমাজ ও সংস্কৃতি","ড. মাযহারুল ইসলাম তরু","গবেষণা","শোভা প্রকাশ","গ্রন্থমেলা ২০০৯",160
"Feb 5, 2009","১০১ লোক কাহিনী","শাহজাহান কিবরিয়া","লোককথা","শোভা প্রকাশ","গ্রন্থমেলা ২০০৯",300
"Feb 5, 2009","বাংলাদেশ রাজনীতির চারদশক","সম্পাদক ড. তারেক শামসুর রেহমান","চার দশকের রাজনীতি","শোভা প্রকাশ","গ্রন্থমেলা ২০০৯",500
"Feb 5, 2009","যে রহস্যের সমাধান হয়নি","আলী ইমাম","বিজ্ঞান","শোভা প্রকাশ","গ্রন্থমেলা ২০০৯",300
"Feb 5, 2009","নির্বাচিত গল্প সংগ্রহ","খালেদা এদিব চৌধুরী","গল্প","শোভা প্রকাশ","গ্রন্থমেলা ২০০৯",200
"Feb 5, 2009","ডন কুইকজোট মিগেল সার্ভেন্টিস","অনু. জুলফিকার নিউটন","উপন্যাস","শোভা প্রকাশ","গ্রন্থমেলা ২০০৯",350
"Feb 5, 2009","সরকারি চাকুরিতে আমার অনুভুতি কিছু লেখায় কিছু কথা","বদিউর রহমান ","প্রবন্ধ","জ্ঞানকোষ প্রকাশনী","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","পাখিদের রূপকথা","মশিউর রহমান খান","কবিতা","মেঘ","গ্রন্থমেলা ২০০৯",80
"Feb 5, 2009","জোছনায় ক্যামোফ্লেজ","সাইদা সারমিন রুমা","কবিতা","বিভাস","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","কাজদা নদী পাড়ে একদিন","খায়রুন নাহার রুবী","কবিতা","বিভাস","গ্রন্থমেলা ২০০৯",70
"Feb 5, 2009","রক্তঝরা নভেম্বর ১৯৭৫","নির্মলেন্দু গুণ","আত্মস্মৃতি","বিভাস","জুন ২০০৮",100
"Feb 5, 2009","বিলাত ভ্রমণ","শরদিন্দু শেখর চাকমা","ভ্রমণকাহিনী","অংকুর প্রকাশনী","গ্রন্থমেলা ২০০৯",160
"Feb 5, 2009","Class and Social Structure of Bangladesh","Bazlul M. Chowdhury","সমাজবিজ্ঞান","অংকুর প্রকাশনী","গ্রন্থমেলা ২০০৯",300
"Feb 5, 2009","অক্ষরে বোনা স্বপ্ন","মহাদেব সাহা","কবিতা","অন্য প্রকাশ","গ্রন্থমেলা ২০০৯",75
"Feb 5, 2009","উদ্ধত আয়ু","ফেরদৌস নাহার","কবিতা","অন্য প্রকাশ","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","কালা পানি","শাকুর মজিদ","ভ্রমণ","অন্য প্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","চৌদ্দ কথা","জিয়া মাসুদ","কবিতা","আকাশ","গ্রন্থমেলা ২০০৯",70
"Feb 5, 2009","ব্লাড শো","গাই এন. স্মিথ","হরর উপন্যাস","বাংলা প্রকাশ","ডিসেম্বর ২০০৮",200
"Feb 5, 2009","হযরত সৈয়দ শাহ মোস্তফা (রঃ) আল বোগদাদী","স’লিপক","জীবনী","প্রতিভা প্রকাশ","জানুয়ারি ২০০৯",150
"Feb 5, 2009","অন্ধত্ব","হোসে সারামাগো, অনু. কবীর চৌধুরী","অনুবাদ","লেখালেখি","গ্রন্থমেলা ২০০৯",350
"Feb 5, 2009","শশী ঘোষ খায় ঘুষ","আবদুল হামিদ মাহবুব","ছড়া","প্রতিভা প্রকাশ","গ্রন্থমেলা ২০০৯",60
"Feb 5, 2009","স্বপ্ন আমার কিচির মিচির","মিনারা আজমী","শিশুতোষ","প্রতিভা প্রকাশ","গ্রন্থমেলা ২০০৯",60
"Feb 5, 2009","মেয়েটি ফিরে এসেছিল","ইমদাদুল হক মিলন","উপন্যাস","বাংলা প্রকাশ","গ্রন্থমেলা ২০০৯",120
"Feb 5, 2009","কল্প বিজ্ঞানের ১৫ গল্প","হাসান খুরশীদ রুমী","বিজ্ঞান বিষয়ক গল্প","বাংলা প্রকাশ","গ্রন্থমেলা ২০০৯",250
"Feb 5, 2009","বোধন","রিফাৎ আরা","কিশোর গল্প","মীরা প্রকাশন","গ্রন্থমেলা ২০০৯",150
"Feb 5, 2009","২১ বছর বয়সকে স্বাগত","ফিরোজ সরকার","গল্প","মীরা প্রকাশন","গ্রন্থমেলা ২০০৯",125
"Feb 5, 2009","বীরের মাটি","রফিকুর রশীদ","কিশোর উপন্যাস","মীরা প্রকাশন","গ্রন্থমেলা ২০০৯",100
"Feb 5, 2009","রাষ্ট্র পরিচালনায় অর্থনীতির গুরুত্ব","ড. এস এম জাহাঙ্গীর আলম","প্রবন্ধ","মুক্তধারা",2008,120
"Feb 5, 2009","শিকারী ইমোক","নাজমাতুল আলম","বাচ্চাদের মজার গল্প","টইটম্বুর","গ্রন্থমেলা ২০০৯",60
"Feb 5, 2009","বন্দি ভূতের ফন্দি ","হাবিব আনিসুর রহমান","গল্প","ঝিঙে ফুল প্রকাশনা","গ্রন্থমেলা ২০০৯",70
"Feb 5, 2009","বই খুললেই ভূত","পলাশ মাহবুব","গল্প","ঝিঙে ফুল প্রকাশনা","গ্রন্থমেলা ২০০৯",75
EOS
    end

    it "should add new rows and redirect to index" do
      old_row_count = Book.count
      post :create, {:data => @sample_data}

      new_row_count = Book.count

      new_row_count.should == @sample_data.split(/\n/).length + old_row_count - 1 #
    end

    it "should add buy_url" do
      data = <<EOF
10532,"কালা পানি","http://www.boi-mela.com/BookDet.asp?BookID=10532","http://www.boi-mela.com/_FPageB/np.jpg","120.00 "
10533,"রাষ্ট্র পরিচালনায় অর্থনীতির গুরুত্ব","http://www.boi-mela.com/BookDet.asp?BookID=10533","http://www.boi-mela.com/_FPageB/np.jpg","120.00 "
EOF
      # at first, add some data
      post :create, {:data => @sample_data}
      puts "Count #{Book.count}"

      # now update with the url
      post :create_url, {:data => data}

      book = Book.find_by_title("রাষ্ট্র পরিচালনায় অর্থনীতির গুরুত্ব")
      puts book.inspect
      book.should_not be_nil
      book.buy_url.should_not be_nil
      book.buy_url.should == "http://www.boi-mela.com/BookDet.asp?BookID=10533"
      book.image_url.should be_nil
    end

    it "should add image url if valid image availbe" do
      data = <<EOF
10532,"কালা পানি","http://www.boi-mela.com/BookDet.asp?BookID=10532","http://www.boi-mela.com/_FPageB/np.jpg","120.00 "
10533,"রাষ্ট্র পরিচালনায় অর্থনীতির গুরুত্ব","http://www.boi-mela.com/BookDet.asp?BookID=10533","http://www.boi-mela.com/_FPageB/10533.jpg","120.00 "
EOF
      # at first, add some data
      post :create, {:data => @sample_data}
      puts "Count #{Book.count}"

      # now update with the url
      post :create_url, {:data => data}

      book = Book.find_by_title("রাষ্ট্র পরিচালনায় অর্থনীতির গুরুত্ব")
      book.should_not be_nil

      book.image_url.should_not be_nil
      book.image_url.should == "http://www.boi-mela.com/_FPageB/10533.jpg"
    end

#    it "should list all the data on index page" do
#      # add new data
#      post :create, {:data => @sample_data}
#
#      total_row_count = Production.count
#
#      get :index, {}, session_data()
#
#      assigns[:productions].should_not be_nil
#      assigns[:productions].length.should == total_row_count
#    end

    it "should list the books under some topic in advanced search" do
      get :advanced, {:topic => "প্রবন্ধ"}
      assigns[:books].should_not be_nil
      puts assigns[:books].total_entries
    end
  end
end
